pvvx/esp8266web/info/libs/main/user_interface.c
/******************************************************************************
 * FileName: user_interface.c
 * Description: disasm user_interface functions SDK 1.1.0..1.4.0 (libmain.a + libpp.a)
 * Author: PV`
 * (c) PV` 2015
 ******************************************************************************/
#include "user_config.h"
#include "bios.h"
#include "hw/esp8266.h"
#include "hw/specreg.h"
#include "hw/gpio_register.h"
//#include "user_interface.h"
#include "sdk/add_func.h"
#include "os_type.h"
#include "user_interface.h"

extern uint32 WdevTimOffSet;

uint8_t os_flg[4];
#define os_pint_ena 	os_flg[0]
#define timer2_ms_flag 	os_flg[1]
#define dhcps_flag 		os_flg[2]
#define dhcpc_flag 		os_flg[3]


extern uint8 * hostname; // in eagle_lwip_if.c
bool default_hostname = true;

uint8 * wifi_station_get_hostname(void)
{
	uint32 opmode = wifi_get_opmode();
	if(opmode == 1 || opmode == 3) {
		return hostname;
	}
	return NULL;
}

void wifi_station_set_default_hostname(uint8 * mac)
{
	if(hostname != NULL)	{
		os_free(hostname);
		hostname = NULL;
	}
	hostname = os_malloc(32);
	if(hostname == NULL) {
		ets_sprintf(hostname,"ESP_%02X%02X%02X", mac[3], mac[4], mac[5]);
	}
}

bool wifi_station_set_hostname(uint8 * name)
{
	if(name == NULL) return false;
	uint32 len = ets_strlen(name);
	if(len > 32) return false;
	uint32 opmode = wifi_get_opmode();
	if(opmode == 1 || opmode == 3) {
		default_hostname = false;
		if(hostname != NULL) {
			os_free(hostname);
			hostname = NULL;
		}
		hostname = os_malloc(len);
		if(hostname == NULL) return false;
		struct netif * nif = eagle_lwip_getif(0);
		ets_strcpy(hostname, name);
		if(nif != NULL) {
			nif->hostname = hostname;
		}
		return true;
	}
	return false;
}


uint32 system_phy_temperature_alert(void)
{
	return phy_get_check_flag(0); // in libphy.a
}

uint32 system_phy_set_max_tpw(uint32 tpw)
{
	return phy_set_most_tpw(tpw);
}
// получить текущее значение tpw мождно использовав phy_in_most_power

uint32 system_get_time(void)
{
	return WdevTimOffSet + IOREG(0x3FF20C00);
}

bool system_os_post(uint8 prio, os_signal_t sig, os_param_t par)
{
	if(prio >= USER_TASK_PRIO_MAX) {
		os_printf_plus("err: post prio < %d\n", USER_TASK_PRIO_MAX);
		return false;
	}
	return ets_post((prio + 22) & 0xFF, sig, par); // in ets.h
}

bool system_os_task(os_task_t task, uint8 prio, os_event_t *queue, uint8 qlen)
{
	if(prio < USER_TASK_PRIO_MAX) {
		os_printf("err: task prio < %d\n", USER_TASK_PRIO_MAX);
		return false;
	}
	if(qlen == 0 || queue == NULL) {
		os_printf("err: task queue error\n");
		return false;
	}
	ets_task(task, prio + 22, queue, qlen);
	return true;
}

bool system_rtc_mem_write(uint8 des_addr, const void *src_addr, uint16 save_size)
{
	int idx;
	const uint32_t *d = src_addr;

	if ((des_addr >= (RTC_MEM_SIZE>>2)) || ((uint32_t)src_addr & 0x3) || ((des_addr << 2) + save_size > RTC_MEM_SIZE)) {
		return 0;
	}
	if(save_size & 3) {
		save_size += 4;
		save_size &= ~3;
	}

	des_addr <<= 2;

	for (idx = 0; idx < save_size; idx += 4) {
		RTC_MEM(des_addr + idx) = *d++;
	}

	return 1;
}


bool system_rtc_mem_read(uint8 src_addr, void *des_addr, uint16 load_size)
{
	int idx;
	uint32_t *d = des_addr;

	if ((src_addr >= (RTC_MEM_SIZE>>2)) || ((uint32_t)des_addr & 0x3) || ((src_addr << 2) + load_size > RTC_MEM_SIZE)) {
		return 0;
	}

	if(load_size & 3) {
		load_size += 4;
		load_size &= ~3;
	}

	src_addr <<= 2;

	for (idx = 0; idx < load_size; idx += 4) {
		*d++ = RTC_MEM(src_addr + idx);
	}

	return 1;
}


uint8 ICACHE_FLASH_ATTR system_get_os_print(void)
{
	return os_pint_ena;
}

void system_pp_recycle_rx_pkt(pkt * pkt)
{
	ppRecycleRxPkt(pkt);
}

uint16 system_adc_read(void)
{
	return test_tout(0); // uint16 test_tout(bool debug) in libphy,  0 - debug sar summ data out off, 1 - debug sar summ data out on
}

uint16 system_get_vdd33(void)
{
	return phy_get_vdd33() & 0x3FF; // uint32 phy_get_vdd33(void) in libphy
}

ETSTimer sta_con_timer;

extern void system_restart_local(void);

void system_restart(void)
{
	int mode = wifi_get_opmode();
	if(mode == STATIONAP_MODE || mode == STATION_MODE ) wifi_station_stop();
	if(mode == STATIONAP_MODE || mode == SOFTAP_MODE ) wifi_softap_stop();
	ets_timer_disarm(sta_con_timer);
	ets_timer_setfn(sta_con_timer, system_restart_local, 0);
	ets_timer_arm_new(sta_con_timer, 100, 0 ,1);
}

void system_restore(void)
{
	uint8 * buf_a12 = os_malloc(sizeof(struct s_wifi_store));
	ets_memset(buf_a12, 0xff, sizeof(struct s_wifi_store));
	ets_memcpy(buf_a12, &g_ic.g.wifi_store, 8);
	uint32 sctrs = flashchip->chip_size/flashchip->sector_size;
	sctrs -= 4;
	wifi_param_save_protect(sctrs, buf_a12, sizeof(struct s_wifi_store));
	os_free(buf_a12);
}

void system_restart_core(void)
{
	Cache_Read_Disable();
	DPORT_OFF24 &= 0x67; // 0x3FF00024 &= 0x67;
	Call _ResetVector(); // ROM:0x40000080
}

/*
void _wait_con_timer(uint8 x) // ????
{
	if (pm_is_open(x) == 0xff) return;
	if((*((uint8 *) (0x3FFE9E64 + 0xFC))) == 0) {
		ets_timer_setfn(0x3FFE9E64, loc_4024079C);
		*((uint8 *) (0x3FFE9E64 + 0xFC)) = 1;
	}
	pm_is_waked();
	uint8 x = *((uint8 *) (0x3FFE9E64 + 0xFC + 0x18));
	if(x == 0 || x == 1)
	{
		if(x==0) {
			pm_post(1);
			ets_timer_disarm(0x3FFE9E64);
			ets_timer_arm_new(0x3FFE9E64, 10, 0, 1);
			*((uint8 *) (0x3FFE9E64 + 0xFC + 0x18)) = 1;

			os_printf_plus("DEFERRED FUNC NUMBER IS BIGGER THAN 10\n");

		}
		x = *((uint8 *) (0x3FFE9E64 + 0xFC + 0x19));
		x ++;
		*((uint8 *) (0x3FFE9E64 + 0xFC + 0x19)) = x;
		if(x == 10) {
			.......
		}
	}
	.....
}
*/
void sta_con_timer_fn(void *timer_arg)
{
	if(_wait_con_timer(4) != 0xff) {

		WDT_REG1 = 0;
		WDT_CTRL |= 0x38;
		uint32 x = WDT_CTRL;
		x &= 0x79;
		x |= 4;
		WDT_CTRL = x;
		WDT_CTRL |= 0x01;

		while(1) ets_delay_us(20000);
	}
}


/* Никчемные функции
uint8 system_get_boot_version(void)
{
	return *((uint8 *)(0x3FFF1769+0x80)) & 0x1F;
}
bool _os_cmp_boot_ver_bl3(void)
{
	uint8 x = system_get_boot_version()
	if(x < 3 || x == 0x1F) {
		os_printf_plus("failed: need boot >= 1.3\n");
	}
}
uint32 system_get_test_result(void)
{
	_os_cmp_boot_ver_bl3();
	0x3FFF1769
	...
}
uint32 system_get_userbin_addr(void)
{

