pvvx/esp8266web/info/libs/main/user_interface.c
}
uint8 system_get_boot_mode(void)
{
	uint8 x = *((uint8 *) (0x3FFF1769 + 0x80));
	x &= 0x1F;
	if(x < 3 || x == 0x1F) return 1;
	return (*((uint8 *) (0x3FFF1769 + 0x80))) >> 7;
}
bool system_restart_enhance(uint8 bin_type, uint32 bin_addr)
{
	if(!_os_cmp_boot_ver_bl3()) return false;
	if(bin_type == 0) {
		uint32 userbin_addr = system_get_userbin_addr();
		os_printf_plus("restart to use user bin @ %x\n", userbin_addr);
		0x3FFF1769
		.....
		wifi_param_save_protect();
		system_restart();
		return 1;
	}
}
bool system_upgrade_userbin_set(uint32 flag)
{
}
uint8 system_upgrade_userbin_check(void)
{
}
void system_upgrade_flag_set(uint8 flag)
{
}
uint8 system_upgrade_flag_check(void)
{
}
void system_upgrade_reboot(void)
{
}
*/
uint32 pm_usec2rtc(uint32 us, uint32 cf)
{
	if(cf == 0) {
		cf = 5;
		return us/cf;
	}
	if(us <= 0xFFFFF) {
		us <<= 12;
		return us/cf;
	}
	else {
		return (us/cf) << 12;
	}
}

void pm_set_sleep_cycles(uint32 cycles)
{
	IO_RTC_SLP_VAL = IO_RTC_SLP_CNT_VAL + cycles;
	if(cycles > 5000) periodic_cal_sat = 1;
	else periodic_cal_sat = 0;
}

void pm_set_sleep_time(int timer_us_arg)
{
	pm_set_sleep_cycles(pm_usec2rtc(timer_us_arg, _coef_usec2rtc));
}

int _div_a2_a3(uint32 x, uint32 qmhz)
{
	return x/qmhz;
}

pm_rtc_clock_cali(uint32 _coef_usec2rtc) // struct xxx *xxx; // struct xxx { uint32 x; uint32 _coef_usec2rtc; ...}
{
	RTC_CALIB_VALUE  &= ~ RTC_CALIB_RDY; // 0x7FFFFFFF;
	RTC_CALIB_SYNC = 0x101; // RTC_PERIOD_NUM = 257
	RTC_CALIB_VALUE |= RTC_CALIB_RDY;
	ets_delay_us(100);
	while((RTC_CALIB_VALUE & RTC_CALIB_RDY) == 0);
	uint8 q = q_mhz; // chip6_phy_init_ctrl + 1 // = 40, 26
	uint32 qmhz = 40;
	if(q == 1) qmhz = 26;
	else if(q == 2) qmhz = 24;
	uint32 x = _div_a2_a3((RTC_CALIB_VALUE & 0xFFFFFFF) >> 4, qmhz);
	if(x == 0) return 0;
	if(_coef_usec2rtc == 0) {
		_coef_usec2rtc = x;
		return x;
	}
	uint32 t;
	if(_coef_usec2rtc >= x) t = _coef_usec2rtc - x;
	else t = x - _coef_usec2rtc;
	if(t > 511) return x;
	_coef_usec2rtc = (x * 5 + _coef_usec2rtc * 3) >> 3;
	return _coef_usec2rtc;
}

int pm_rtc_clock_cali_proc(void)
{
	rom_i2c_writeReg(106,2,8,0);
	pm_rtc_clock_cali(_coef_usec2rtc);
	return _coef_usec2rtc;
}

uint8 system_option[250];
#define deep_sleep_option system_option[241]

void _sys_deep_sleep_timer(void *timer_arg)
{
	os_printf_plus("deep sleep %ds\n\n", timer_arg/1000000);
	deep_sleep_set_option(deep_sleep_option);
//	while(READ_PERI_REG(UART_STATUS(0))  & (UART_TXFIFO_CNT<<UART_TXFIFO_CNT_S));
//	while(READ_PERI_REG(UART_STATUS(1))  & (UART_TXFIFO_CNT<<UART_TXFIFO_CNT_S));
	user_uart_wait_tx_fifo_empty(0, 500000);
	user_uart_wait_tx_fifo_empty(1, 500000);

	IO_RTC_0 = 0;
	IO_RTC_0 &= ~BIT14;
	IO_RTC_0 |= 0x30;
	RTC_BASE[17] = 4; //0x60000744 = 4
	IO_RTC_3 = 0x10010; // 	HWREG(PERIPHS_RTC_BASEADDR, 0x0C) = 0x10010;
	RTC_BASE[18] = (RTC_BASE[18] &  0xFFFF01FF) | 0xFC00; // HWREG(PERIPHS_RTC_BASEADDR, 0x48) = (HWREG(PERIPHS_RTC_BASEADDR,0x48) & 0xFFFF01FF) | 0xFC00;
	RTC_BASE[18] = (RTC_BASE[18] &  0xE00) | 0x80; // HWREG(PERIPHS_RTC_BASEADDR, 0x48) = (HWREG(PERIPHS_RTC_BASEADDR, 0x48) & 0xE00) | 0x80;
	IO_RTC_SLP_VAL = IO_RTC_SLP_CNT_VAL + 136; //	HWREG(PERIPHS_RTC_BASEADDR, 0x04) = HWREG(PERIPHS_RTC_BASEADDR, 0x1C) + 0x88;
	IO_RTC_6 = 8; // HWREG(PERIPHS_RTC_BASEADDR, 0x18) = 8;
	IO_RTC_2 = 0x100000; // HWREG(PERIPHS_RTC_BASEADDR, 0x08) = 0x100000;
	ets_delay_us(200);
	RTC_GPI2_CFG = 0x11; //	HWREG(PERIPHS_RTC_BASEADDR, 0x9C) = 0x11;
	IO_PAD_XPD_DCDC_CONF = 0x03; // HWREG(PERIPHS_RTC_BASEADDR, 0xA0) = 0x03;
	IO_RTC_3 = 0x640C8; // HWREG(PERIPHS_RTC_BASEADDR, 0x0C) = 0x640C8;
	IO_RTC_0 &= 0xFCF; // HWREG(PERIPHS_RTC_BASEADDR, 0x00) &= 0xFCF;
	uint32 clpr = pm_rtc_clock_cali_proc();
	pm_set_sleep_time(timer_arg);
	RTC_GPI2_CFG &= 0x11; //	HWREG(PERIPHS_RTC_BASEADDR, 0x9C) &= 0x11;
	IO_PAD_XPD_DCDC_CONF = 0x03; // HWREG(PERIPHS_RTC_BASEADDR, 0xA0) = 0x03;

	INTC_EDGE_EN &= 0x7E; // HWREG(PERIPHS_DPORT_BASEADDR, 4) &= 0x7E; // WDT int off
	ets_isr_mask(1<<8); // Disable WDT isr

	RTC_BASE[16] = 0x7F; // HWREG(PERIPHS_RTC_BASEADDR, 0x40) = 0x7F;
	RTC_BASE[16] = 0x20; // HWREG(PERIPHS_RTC_BASEADDR, 0x44) = 0x20;
	IO_RTC_4 = 0; // HWREG(PERIPHS_RTC_BASEADDR, 0x10) = 0x00;

	if(clpr == 0) {
		IO_RTC_6 = 0; //	HWREG(PERIPHS_RTC_BASEADDR, 0x18) = 0x00;
	}
	else {
		IO_RTC_6 = 8;	//	HWREG(PERIPHS_RTC_BASEADDR, 0x18) = 0x08;
	}
	ets_intr_lock();
	Cache_Read_Disable();
	SPI0_CMD = 0x200000;
	while(SPI0_CMD);
	struct rst_info rst_info;
	system_rtc_mem_read(0, rst_info, sizeof(rst_info));
	ets_memset(rst_info, 0, sizeof(rst_info));
	system_rtc_mem_write(0, &rst_info, sizeof(rst_info));
	IO_RTC_2 = 1<<20; // rtc_enter_sleep()	HWREG(PERIPHS_RTC_BASEADDR, 0x08) = 0x100000;
}

uint8 deep_sleep_flag;

void system_deep_sleep(uint32 time_in_us)
{
	if(wifi_get_opmode() != SOFTAP_MODE) wifi_station_stop();
	if(wifi_get_opmode() != STATION_MODE) wifi_softap_stop();
	deep_sleep_flag = 1;
	ets_timer_disarm(sta_con_timer);
	ets_timer_setfn(sta_con_timer, _sys_deep_sleep_timer, 0);
	ets_timer_arm_new(sta_con_timer,100, 0, 1);
}

uint8 deep_sleep_option;

bool system_deep_sleep_set_option(uint8 option)
{
	switch(option) {
	case 0:
	case 1:
	case 2:
	case 4:
		deep_sleep_option  = option; // 0x3FFE9E60 + 0xF1 = option;
		return true;
	}
	return false;
}
/* Никчемные функции
bool system_update_cpu_freq(uint8 freq)
{
	if(freq == 80) {
		HWREG(PERIPHS_DPORT_BASEADDR,0x14) &= 0x7E;
	 	system_update_cpu_freq(80);
	 	return true;
	}
	if(freq == 160) {
		HWREG(PERIPHS_DPORT_BASEADDR,0x14) |= 0x01;
	 	system_update_cpu_freq(160);
	 	return true;
	}
	return false;
}
uint8 system_get_cpu_freq(void)
{
	return ets_get_cpu_frequency();
}

#define cpu_overclock system_option[0xF2]

bool system_overclock(void)
{
	if(system_get_cpu_freq()!=80) {
		cpu_overclock = 1;
	 	system_update_cpu_freq(160);
	 	return true;
	}
	return false;
}
bool system_restoreclock(void)
{
	if(system_get_cpu_freq() == 160) {
		if(cpu_overclock) {
			system_update_cpu_freq(80);
			return true;
		}
	}
	return false;
}
*/
void system_timer_reinit(void)
{
	timer2_ms_flag = 0;
	TIMER1_CTRL = 0x84;
}


uint32 system_relative_time(void)
{
	return *((uint32*)0x3FF20C00);
}
void system_print_meminfo(void)
{
	os_printf_plus("data  : 0x%x ~ 0x%x, len: %d\n", 0x3FFE8000, _data_end, _data_end - 0x3FFE8000);
	os_printf_plus("rodata: 0x%x ~ 0x%x, len: %d\n", _rodata_start, _bss_start, _bss_start - _rodata_start);
	os_printf_plus("bss   : 0x%x ~ 0x%x, len: %d\n", _bss_start, _heap_start, _heap_start - _bss_start);
	os_printf_plus("heap  : 0x%x ~ 0x%x, len: %d\n", _heap_start, 0x3FFFC000 , 0x3FFFC000 - _heap_start);
}
uint32 xPortGetFreeHeapSize(void)
{
	return FreeHeapSize; // *((uint32*)0x3FFE9E50);  *((uint32*)0x3FFE9CB0);
}
uint32 system_get_free_heap_size(void)
{
	xPortGetFreeHeapSize();
}
uint32 system_get_chip_id(void)
{
	return (HWREG(PERIPHS_DPORT_BASEADDR,0x50) &  0xFF000000) | (HWREG(PERIPHS_DPORT_BASEADDR, 0x54) & 0xFFFFFF);
}
uint32 system_rtc_clock_cali_proc(void)
{
	return pm_rtc_clock_cali_proc();
}
uint32 system_get_rtc_time(void)
{
	return IO_RTC_SLP_CNT_VAL; // 0x6000071C
}
/*
uint64 system_mktime(uint32 year, uint32 mon, uint32 day, uint32 hour, uint32 min, uint32 sec)
{
.........
}
*/
void system_init_done_cb(init_done_cb_t cb)
{
    done_cb = cb;	//*((init_done_cb_t *)(&system_option[0xF4])) = cb;
}

void system_uart_swap(void)
{
	user_uart_wait_tx_fifo_empty(0, 500000);
	user_uart_wait_tx_fifo_empty(1, 500000);

	GPIO13_MUX = (GPIO13_MUX & 0xECF) | 0x100;
	GPIO15_MUX = (GPIO15_MUX & 0xECF) | 0x100;
	PERI_IO_SWAP |= BIT2;
}

void system_uart_de_swap(void)
{
	user_uart_wait_tx_fifo_empty(0, 500000);
	user_uart_wait_tx_fifo_empty(1, 500000);
	PERI_IO_SWAP &= 0x7B;
}

const char *system_get_sdk_version(void)
{
	return "1.3.0";
}

uint32 ICACHE_FLASH_ATTR system_get_checksum(uint8 *ptr, uint32 len)
{
	uint8 checksum = 0xEF;
	while(len--) checksum ^= *ptr++;
	return checksum;
}

