pvvx/esp8266web/info/libs/main/user_interface.c
bool wifi_softap_dhcps_start(void)
{
	int opmode = wifi_get_opmode();
	if(opmode == STATION_MODE || opmode == NULL_MODE || g_ic.c[0x180+0x3E] == 0) return false;
	struct netif * nif;
	nif = eagle_lwip_getif(1);
	if(nif == NULL && (!dhcps_flag)) {
		struct ip_info *ipinfo;
		wifi_get_ip_info(SOFTAP_IF, &ipinfo);
		dhcps_start(ipinfo);
	}
	dhcps_flag = true;
	return true;
}

bool wifi_softap_dhcps_stop(void)
{
	int opmode = wifi_get_opmode();
	if(opmode == STATION_MODE || opmode == NULL_MODE || g_ic.c[0x180+0x3E] != 0) return false;
	struct netif * nif;
	nif = eagle_lwip_getif(1);
	if(nif != NULL && dhcps_flag) dhcps_stop();
	dhcps_flag = false;
	return true;
}

enum dhcp_status wifi_softap_dhcps_status(void)
{
	return dhcps_flag;
}

bool wifi_station_dhcpc_start(void)
{
	int opmode = wifi_get_opmode();
	if(opmode == STATION_MODE || opmode == NULL_MODE || g_ic.c[0x180+0x3E] != 0) return false;
	struct netif * nif;
	nif = eagle_lwip_getif(0);
	if(nif == NULL && (!dhcpc_flag)) {
		if(nif->flags & 1) { // nif->[+0x35]
			nif->ip_addr.addr = 0;
			nif->gw.addr = 0;
			nif->netmask.addr = 0;
			if( dhcp_start() != ERR_OK) return false;
		}
	}
	dhcpc_flag = true;
	return true;
}

bool wifi_station_dhcpc_stop(void){
	int opmode = wifi_get_opmode();
	if(opmode == STATION_MODE || opmode == NULL_MODE || g_ic.c[0x180+0x3E] != 0) return false; // g_ic.c[0x1BE] g_ic +446
	struct netif * nif;
	nif = eagle_lwip_getif(0);
	if(nif == NULL && (!dhcpc_flag)) {
		dhcp_stop();
	}
	dhcpc_flag = false;
	return true;
}
enum dhcp_status wifi_station_dhcpc_status(void)
{
	return dhcpc_flag;
}


bool system_param_save_with_protect(uint16 start_sec, void *param, uint16 len)
{
	struct ets_store_wifi_hdr whd;
	if(param == NULL) return false;
	if(flashchip->sector_size < len) return false;
	spi_flash_read((start_sec + 2)*flashchip->sector_size, &whd, sizeof(whd));
	if(whd.bank == 0) whd.bank = 1;
	wifi_param_save_protect_with_check(start_sec + whd.bank, flashchip->sector_size, param, len);
	whd.flag = 0x55AA55AA;
	if(++whd.wr_cnt == 0) whd.wr_cnt = 1;
	whd.xx[whd.bank] = 28;
	whd.chk[whd.bank] = system_get_checksum(param, 28);
	wifi_param_save_protect_with_check(start_sec + 2, flashchip->sector_size, &whd, 28);
	return true;
}

void wifi_param_save_protect_with_check(uint16 startsector, int sectorsize, void *pdata, uint16 len)
{
	uint8 * pbuf = os_malloc(len);
	int i;
	if(pbuf == NULL) return;
	do {
		spi_flash_erase_sector(startsector);
		spi_flash_write(startsector*sectorsize, pdata, len);
		spi_flash_read(startsector*sectorsize, pbuf, len);
		i = ets_memcmp(pdata, pbuf, len);
		if(i) {
			os_printf("[W]sec %x error\n", startsector);
		}
	} while(i != 0);
	os_free(pbuf);
}

bool system_param_load(uint16 start_sec, uint16 offset, void *param, uint16 len)
{
	struct ets_store_wifi_hdr whd;
	if(param == NULL || (len + offset) > flashchip->sector_size) return false;
	spi_flash_read((start_sec + 2)*flashchip->sector_size, &whd, sizeof(whd));
	uint32 data_sec = start_sec;
	if(whd.bank) data_sec++;
	spi_flash_read(data_sec * flashchip->sector_size + offset, param, len);
	return true;
}

uint8 wifi_get_channel(void)
{
	uint8 *ptr = chm_get_current_channel();
	return ptr[6];
}

bool wifi_set_channel(uint8 channel)
{
	if(channel > 13) return false;
	ets_intr_lock();
	uint32 * p = &g_ic;
	p[300] = channel*6 + 0x78; // ???
	ets_intr_unlock();
	chm_set_current_channel(channel);
	return true;
}

enum sleep_type wifi_get_sleep_type(void)
{
	return pm_get_sleep_type();
}

bool ICACHE_FLASH_ATTR wifi_set_sleep_type(enum sleep_type type)
{
	if(type > MODEM_SLEEP_T) return false;
	pm_set_sleep_type_from_upper(type);
	return true;
}

bool ICACHE_FLASH_ATTR wifi_promiscuous_set_mac(const uint8_t *address)
{
	if(g_ic.c[0x180+0x3e] != 1) return false;
	volatile uint32 * preg = (volatile uint32 *)0x3FF20000;
	preg[27] |= 1;
	preg[27] |= 2;
	preg[27] |= 4;
	wDev_SetMacAddress(0, address);
	return true;
}

wifi_promiscuous_cb_t promiscuous_cb;
void ICACHE_FLASH_ATTR wifi_set_promiscuous_rx_cb(wifi_promiscuous_cb_t cb)
{
	promiscuous_cb = cb;
}

uint8 info_st_mac[6];

int ICACHE_FLASH_ATTR wifi_promiscuous_enable(uint8 promiscuous)
{
	int opmode	= wifi_get_opmode();
	if(user_init_flag & opmode == 1) {
		if(g_ic.c[446] != 3) {
			if(promiscuous == 0) {
				if(g_ic.c[446] != 0) {
					wDevDisableRx();
					wdev_exit_sniffer();
					volatile uint32 * preg = (volatile uint32 *)0x3FF20000;
					preg[27] |= 1;
					preg[27] |= 2;
					preg[27] |= 4;
					wDev_SetMacAddress(0, info_st_mac);
					g_ic.c[446] = 0;
					wDevEnableRx();
					return true;
				}
				return true; //??
			}
			else {
				if(g_ic.c[446] == 1) return true;;
				wifi_station_disconnect();
				wDevDisableRx();
				volatile uint32 * preg = (volatile uint32 *)0x3FF20000;
				preg[27] &= 0xFFE;
				preg[27] &= 0xFFD;
				preg[27] &= 0x7B;
				g_ic.c[446]= 1;
				wdev_go_sniffer();
				wDevEnableRx();
				return true;
			}
		}
	}
	return 0;
}

typedef struct {
    uint32 event;
    Event_StaMode_Got_IP_t info;
} System_Event_goy_ip;

wifi_event_handler_cb_t event_cb;

void ICACHE_FLASH_ATTR system_station_got_ip_set(ip_addr_t ip, ip_addr_t netmask, ip_addr_t gw)
{
	if(event_cb != NULL || g_ic.g.netif1 != NULL) {
		if(g_ic.g.netif1->ip_addr != ip
		|| g_ic.g.netif1->netmask != netmask
		|| g_ic.g.netif1->gw != gw) {
			System_Event_goy_ip ev_par;
			ev_par.info.ip = g_ic.g.netif1->ip_addr;
			ev_par.info.mask = g_ic.g.netif1->netmask;
			ev_par.info.gw = g_ic.g.netif1->gw;
			ev_par.event = EVENT_STAMODE_GOT_IP;
			event_cb((System_Event_t *)&ev_par);
		}
		// os_printf("ip:%d.%d.%d.%d,mask:%d.%d.%d.%d,gw:%d.% ...", g_ic.g.netif1->ip_addr, ... );
		g_ic.g.netif1[186] = 5; //??
		g_ic.g.netif1[184] = 5; //??
		if(g_ic.g.wifi_store.wfmode[1] == 1 && g_ic.g.wifi_store.wfmode[0] == 1) {
			ets_timer_disarm(sta_con_timer);
			g_ic.c[90];
			if(status_led_output_level & 1) {
				// sll 1 ??
			}
			gpio_output_set(, (status_led_output_level & 1)? 0: 1, c,0);
		}
	}
}

extern struct rst_info rst_if;
struct rst_info* ICACHE_FLASH_ATTR system_get_rst_info(void)
{
	return &rst_if;
}

